Canonical-Flows/jet/case1/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{	
    inlet1
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
	
	inlet2
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
	
    outlet
    {
        type            fixedValue;
        value           $internalField;
    }
	
	wall
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
	
}

// ************************************************************************* //
